# ExternalResourceServerExtensions Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalResourceServerExtensions Members
ExternalResourceServerExtensions Class Methods Properties See Also
---
The ExternalResourceServerExtensions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the ExternalResourceServerExtensions |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetCADLinkOperations | Gets the specific methods supported by external resource CAD Links. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetRevitLinkOperations | Gets the specific methods supported by the external resource of Revit Links. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
ExternalResourceServerExtensions Class
Autodesk.Revit.DB Namespace